classstatus/app/controllers/courses_controller.rb

    def create
      # render plain: params[:course].inspect
      @course = Course.new(course_params)

      if @course.save
---
INSERT INTO "courses" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Game Design & Programming 1"], ["created_at", "2020-01-02 01:34:22.342848"], ["updated_at", "2020-01-02 01:34:22.342848"]]