classstatus/app/controllers/sections_controller.rb

    def index
      @sections = Section.order(:name)
---
SELECT "sections".* FROM "sections" ORDER BY "sections"."name" ASC

    def edit
      @section = Section.find(params[:id])
---
SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
      # render plain: params[:section].inspect
      @section = Section.new(section_params)

      if @section.save
---
INSERT INTO "sections" ("name", "course_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "S2A1"], ["course_id", 1], ["created_at", "2020-01-02 02:33:40.271391"], ["updated_at", "2020-01-02 02:33:40.271391"]]

    def update
      @section = Section.find(params[:id])

      if @section.update(section_params)
---
SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "sections" SET "course_id" = ?, "updated_at" = ? WHERE "sections"."id" = ?  [["course_id", 2], ["updated_at", "2020-01-02 02:39:17.416998"], ["id", 1]]

    def destroy
      @section = Section.find(params[:id])
      @section.destroy
---
SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "sections" WHERE "sections"."id" = ?  [["id", 1]]