classstatus/app/controllers/students_controller.rb

INSERT INTO "students" ("given_name", "family_name", "github_user", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["given_name", "Aiden"], ["family_name", "Donnelly"], ["github_user", ""], ["created_at", "2020-01-02 07:29:34.460100"], ["updated_at", "2020-01-02 07:29:34.460100"]]
---
  def import
    count = 0
    dupes = 0

    roster = File.read(params[:file].path)
    roster_hash = JSON.parse(roster)

    students = roster_hash['students']
    students.map do |s|
      p = ActionController::Parameters.new(student: s.to_hash)
      @student = Student.new(student_params(p))
      @student.save!

INSERT INTO "students" ("given_name", "family_name", "github_user", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["given_name", "Ian"], ["family_name", "Hendricksen"], ["github_user", "MKDreadSword"], ["created_at", "2020-01-01 23:14:32.453931"], ["updated_at", "2020-01-01 23:14:32.453931"]]
---
  def create
    # render plain: params[:student].inspect
    @student = Student.new(student_params)

    if @student.save

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]
UPDATE "students" SET "github_user" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["github_user", "xLuna484x"], ["updated_at", "2020-01-02 07:30:21.717683"], ["id", 24]]
---
  def update
    @student = Student.find(params[:id])

    if @student.update(student_params)