classstatus/app/views/sections/_form.html.erb

    <%= form.label :course %><br>
    <%= form.collection_select :course_id, Course.order(:name), :id, :name %>
---
SELECT "courses".* FROM "courses" ORDER BY "courses"."name" ASC