classstatus/app/views/sections/index.html.erb

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
      <td><%= section.name %></td>
      <td><%= Course.find(section.course_id).name %></td>