classstatus/app/views/students/index.html.erb

  <%= file_field_tag :file %>
  <%= select_tag :section,
        options_from_collection_for_select(Section.order(:name), "id", "name"),
        include_blank: "Select Section" %>
---
SELECT "sections".* FROM "sections" ORDER BY "sections"."name" ASC